translational-galloping-ms20/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       34480;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       34600;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       34720;
    }
    top
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          150;
        startFace       34820;
    }
    bottom
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          150;
        startFace       34970;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          34800;
        startFace       35120;
    }
)

// ************************************************************************* //
