translational-galloping-ms20/0/motionScale
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointScalarField;
    location    "0";
    object      motionScale;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
35440
(
0.0436047
0.0460704
0.048635
0.0512998
0.0540659
0.0569339
0.0599046
0.0629778
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
    }
    outlet
    {
        type            calculated;
    }
    cylinder
    {
        type            calculated;
    }
    top
    {
        type            calculated;
    }
    bottom
    {
        type            calculated;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
